app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE (title like '%FIS32%') AND (tags like '%FIS32%')
SELECT  `articles`.* FROM `articles`  ORDER BY `articles`.`id` DESC LIMIT 1
---
  def index
    if params[:search]
      @articles = Article.where("title like ?", "%#{params[:search]}%" || "tags like ?", "%#{params[:search]}%")
    else
      @articles = Article.all

INSERT INTO `articles` (`title`, `author`, `resumo`, `tags`, `pdf_file_name`, `pdf_content_type`, `pdf_file_size`, `pdf_updated_at`, `publication_at`, `created_at`, `updated_at`) VALUES ('optica', 'teste', 'teste', 'tearw', 'PARTE_III_–_ÓPTICA_GEOMÉTRICA_Tópico_2.pdf', 'application/pdf', 3192601, '2016-05-18 05:00:40', '2016-05-18', '2016-05-18 05:00:40', '2016-05-18 05:00:40')
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE `articles` SET `title` = 'Prova da Lara', `author` = 'Lara', `resumo` = 'Prova do Capeta', `tags` = 'Capeta, FIS32', `pdf_updated_at` = '2016-05-28 03:02:33', `pdf_file_name` = 'Lista_01_-_Lara.pdf', `updated_at` = '2016-05-28 03:02:33' WHERE `articles`.`id` = 1
---
  def update
    respond_to do |format|
      if @article.update(article_params)